[
  {
    "id": 1,
    "date": "2026-02-20",
    "text": "In 2007, federal prosecutors prepared a 32-count draft indictment describing Epstein as an extremely high flight risk and a continued danger to the community.",
    "redacted": ["32", "flight", "danger"],
    "source": "DOJ Released Files, 2007 Draft Indictment — reported by NYT, AP",
    "context": "The indictment was never filed. Instead, U.S. Attorney Alexander Acosta signed off on a plea deal.",
    "difficulty": "medium"
  },
  {
    "id": 2,
    "date": "2026-02-21",
    "text": "Ghislaine Maxwell was mentioned 13,169 times across the released Epstein files, making her one of the most frequently referenced individuals.",
    "redacted": ["Maxwell", "13,169", "frequently"],
    "source": "DOJ Epstein Files Release, January 2026 — reported by BBC, CNN",
    "context": "Maxwell was convicted in 2021 of sex trafficking and is currently serving a 20-year sentence.",
    "difficulty": "easy"
  },
  {
    "id": 3,
    "date": "2026-02-22",
    "text": "Epstein's assistant Lesley Groff appeared 157,613 times in the released documents, the highest mention count of any individual in the files.",
    "redacted": ["Groff", "157,613", "highest"],
    "source": "DOJ Epstein Files, February 2026 analysis — reported by multiple outlets",
    "context": "Groff served as Epstein's executive assistant for decades and was identified as an alleged co-conspirator.",
    "difficulty": "hard"
  },
  {
    "id": 4,
    "date": "2026-02-23",
    "text": "Flight logs showed Epstein's private planes made over 1,700 documented flights between November 1995 and August 2013.",
    "redacted": ["1,700", "November", "August"],
    "source": "Unsealed flight manifests, Giuffre v. Maxwell — reported by Business Insider",
    "context": "The logs were unsealed during Virginia Giuffre's defamation case against Maxwell.",
    "difficulty": "hard"
  },
  {
    "id": 5,
    "date": "2026-02-24",
    "text": "An FBI employee diagram showed Epstein's inner circle including Maxwell, lawyer Darren Indyke, and accountant Richard Kahn.",
    "redacted": ["diagram", "Indyke", "Kahn"],
    "source": "DOJ Released Files — reported by CNN, NYT",
    "context": "The undated diagram also listed French model agent Jean-Luc Brunel among Epstein's close associates.",
    "difficulty": "hard"
  },
  {
    "id": 6,
    "date": "2026-02-25",
    "text": "Peter Mandelson allegedly sent market sensitive UK government information to Epstein, including Prime Minister Gordon Brown's secret pseudonym.",
    "redacted": ["Mandelson", "Brown", "pseudonym"],
    "source": "DOJ Epstein Files — reported by BBC, The Guardian, ITV News",
    "context": "Brown's pseudonym was reportedly 'John Pond' and his secure email address was also shared.",
    "difficulty": "medium"
  },
  {
    "id": 7,
    "date": "2026-02-26",
    "text": "In 2008, Epstein accepted a plea deal in Florida and pleaded guilty to soliciting prostitution from someone under age 18.",
    "redacted": ["plea", "Florida", "18"],
    "source": "Palm Beach County Court Records — reported by Miami Herald",
    "context": "The deal, overseen by U.S. Attorney Alexander Acosta, allowed Epstein to avoid federal charges.",
    "difficulty": "easy"
  },
  {
    "id": 8,
    "date": "2026-02-27",
    "text": "French model agent Jean-Luc Brunel was mentioned 4,727 times in the files before dying by suicide in a Paris jail in 2022.",
    "redacted": ["Brunel", "Paris", "2022"],
    "source": "DOJ Epstein Files — reported by BBC, AP",
    "context": "Brunel faced rape charges in France and was under investigation for sex trafficking of minors.",
    "difficulty": "medium"
  },
  {
    "id": 9,
    "date": "2026-02-28",
    "text": "The DOJ released 3 million pages on January 30, 2026, including 2,000 videos and 180,000 images from the investigation.",
    "redacted": ["January", "2,000", "180,000"],
    "source": "U.S. Department of Justice Press Release, January 30, 2026",
    "context": "The DOJ stated this would be the final release, claiming it met obligations under the Epstein Files Transparency Act.",
    "difficulty": "hard"
  },
  {
    "id": 10,
    "date": "2026-03-01",
    "text": "FBI agents identified over 35 underage girls with similar stories of abuse at Epstein's Palm Beach mansion during their investigation.",
    "redacted": ["35", "Palm", "mansion"],
    "source": "FBI Investigation Records — reported by Miami Herald, Vox",
    "context": "The investigation began in 2005 after a woman reported her 14-year-old stepdaughter was taken to the property.",
    "difficulty": "easy"
  },
  {
    "id": 11,
    "date": "2026-03-02",
    "text": "An employee at Epstein's Florida estate told the FBI he was instructed to fan hundred-dollar bills on a table near Epstein's bed.",
    "redacted": ["employee", "bills", "bed"],
    "source": "FBI Interview Notes, DOJ Release — reported by AP",
    "context": "The same employee described disposing of used condoms and placing a gun between Epstein's mattresses.",
    "difficulty": "medium"
  },
  {
    "id": 12,
    "date": "2026-03-03",
    "text": "Al Seckel emailed Epstein in 2010 about replacing his mugshot on Wikipedia and removing the term sex offender from his article.",
    "redacted": ["Seckel", "Wikipedia", "offender"],
    "source": "DOJ Epstein Files, Email Records — reported by multiple outlets",
    "context": "This was part of Epstein's efforts to rebuild his public image after being released from jail in July 2009.",
    "difficulty": "medium"
  },
  {
    "id": 13,
    "date": "2026-03-04",
    "text": "Virginia Giuffre filed a defamation lawsuit against Ghislaine Maxwell that led to the unsealing of thousands of court documents.",
    "redacted": ["Giuffre", "defamation", "thousands"],
    "source": "Giuffre v. Maxwell, U.S. District Court SDNY",
    "context": "The lawsuit resulted in multiple rounds of document releases starting in 2019 and continuing through 2024.",
    "difficulty": "easy"
  },
  {
    "id": 14,
    "date": "2026-03-05",
    "text": "A United Nations panel stated the Epstein files revealed a global criminal enterprise that could meet the threshold of crimes against humanity.",
    "redacted": ["Nations", "criminal", "humanity"],
    "source": "UN Human Rights Council Statement, February 2026 — reported by Reuters, BBC",
    "context": "The panel of independent experts was appointed by the UN Human Rights Council.",
    "difficulty": "medium"
  },
  {
    "id": 15,
    "date": "2026-03-06",
    "text": "Epstein owned a private island called Little Saint James in the U.S. Virgin Islands where much of the alleged abuse took place.",
    "redacted": ["Little", "James", "Virgin"],
    "source": "Property records, U.S. Virgin Islands — widely reported",
    "context": "The island was colloquially known as 'Pedophile Island' and was a key location in the investigation.",
    "difficulty": "easy"
  },
  {
    "id": 16,
    "date": "2026-03-07",
    "text": "The Epstein Files Transparency Act was passed by the House, unanimously approved by the Senate, and signed by President Trump in November 2025.",
    "redacted": ["Transparency", "unanimously", "November"],
    "source": "U.S. Congress Records — reported by NBC, AP",
    "context": "Trump had floated the idea of releasing the files during his 2024 presidential campaign.",
    "difficulty": "medium"
  },
  {
    "id": 17,
    "date": "2026-03-08",
    "text": "Former Norwegian prime minister Thorbjorn Jagland was charged with aggravated corruption due to his ties to Epstein revealed in the files.",
    "redacted": ["Norwegian", "Jagland", "corruption"],
    "source": "DOJ Epstein Files — reported by international media, February 2026",
    "context": "Jagland was one of three people who had criminal investigations launched after the files were released.",
    "difficulty": "hard"
  },
  {
    "id": 18,
    "date": "2026-03-09",
    "text": "Andrew Mountbatten-Windsor was arrested on February 19, 2026, following revelations in the released Epstein documents about his connections.",
    "redacted": ["Andrew", "arrested", "February"],
    "source": "DOJ Epstein Files — reported by BBC, The Guardian, NYT",
    "context": "Andrew had previously strenuously denied any wrongdoing related to Epstein.",
    "difficulty": "easy"
  },
  {
    "id": 19,
    "date": "2026-03-10",
    "text": "Journalist Julie Brown published an investigative series about Epstein's abuse and plea deal in the Miami Herald in 2018.",
    "redacted": ["Brown", "Miami", "2018"],
    "source": "Miami Herald, 'Perversion of Justice' series",
    "context": "Brown's reporting prompted a fresh investigation by New York federal prosecutors that led to Epstein's 2019 arrest.",
    "difficulty": "easy"
  },
  {
    "id": 20,
    "date": "2026-03-11",
    "text": "In 1996, Maria Farmer reported to the FBI that Epstein had stolen naked photos of her underage siblings, but no investigation was conducted.",
    "redacted": ["Farmer", "1996", "siblings"],
    "source": "FBI Records — reported by NYT, Miami Herald",
    "context": "This was one of the earliest known reports about Epstein's criminal behavior.",
    "difficulty": "medium"
  },
  {
    "id": 21,
    "date": "2026-03-12",
    "text": "Les Wexner, the billionaire founder of L Brands, employed Epstein as a money manager and claimed he severed ties in 2007.",
    "redacted": ["Wexner", "Brands", "2007"],
    "source": "DOJ Files, Business Records — reported by NYT, WSJ",
    "context": "Wexner granted Epstein sweeping power over his finances and gave him a Manhattan townhouse.",
    "difficulty": "medium"
  },
  {
    "id": 22,
    "date": "2026-03-13",
    "text": "An 86-page memo titled Investigation into Potential Co-Conspirators was sent to US Attorney Geoffrey Berman on December 19, 2019.",
    "redacted": ["86", "Berman", "December"],
    "source": "DOJ Released Files, SDNY Prosecution Memo — reported by Miami Herald",
    "context": "The memo contained statements from 24 women who reported being abused as minors and 14 as adults.",
    "difficulty": "hard"
  },
  {
    "id": 23,
    "date": "2026-03-14",
    "text": "Epstein's Gulfstream jet with tail number N908JE was the primary aircraft used in flights documented in the logs.",
    "redacted": ["Gulfstream", "N908JE", "primary"],
    "source": "FAA Records, Flight Manifests — reported by Business Insider",
    "context": "The plane was commonly referred to as the 'Lolita Express' in media coverage.",
    "difficulty": "hard"
  },
  {
    "id": 24,
    "date": "2026-03-15",
    "text": "Epstein died in his cell at the Metropolitan Correctional Center in Manhattan on August 10, 2019, in what was ruled a suicide.",
    "redacted": ["Metropolitan", "Manhattan", "suicide"],
    "source": "NYC Medical Examiner Report — widely reported",
    "context": "His death sparked widespread conspiracy theories and criticism of the federal prison system.",
    "difficulty": "easy"
  },
  {
    "id": 25,
    "date": "2026-03-16",
    "text": "The Jmail archive has catalogued over 1.4 million files and 2.4 million pages from the DOJ release and House Oversight Committee.",
    "redacted": ["Jmail", "million", "Oversight"],
    "source": "Jmail Archive Statistics, February 2026",
    "context": "Jmail is a browser-based archive dedicated to making the Epstein files searchable and accessible.",
    "difficulty": "hard"
  },
  {
    "id": 26,
    "date": "2026-03-17",
    "text": "Ghislaine Maxwell was convicted in December 2021 of sex trafficking and conspiracy and sentenced to 20 years in federal prison.",
    "redacted": ["Maxwell", "trafficking", "20"],
    "source": "U.S. v. Maxwell, SDNY — widely reported",
    "context": "Maxwell was found guilty on five of six counts after a month-long trial in Manhattan.",
    "difficulty": "easy"
  },
  {
    "id": 27,
    "date": "2026-03-18",
    "text": "Common flight routes included Teterboro to Palm Beach and Palm Beach to Saint Thomas with different passengers on each leg.",
    "redacted": ["Teterboro", "Palm", "Thomas"],
    "source": "Flight Manifests, Giuffre v. Maxwell — reported by Business Insider",
    "context": "Passengers would join or depart at different stops, complicating efforts to track who visited the island.",
    "difficulty": "medium"
  },
  {
    "id": 28,
    "date": "2026-03-19",
    "text": "Johanna Sjoberg gave a 2016 deposition mentioning politicians and public figures she encountered at Epstein's properties.",
    "redacted": ["Sjoberg", "2016", "politicians"],
    "source": "Giuffre v. Maxwell Court Documents, 2024 Unsealing — reported by TIME",
    "context": "Sjoberg was one of Epstein's victims who provided testimony in the Maxwell defamation lawsuit.",
    "difficulty": "hard"
  },
  {
    "id": 29,
    "date": "2026-03-20",
    "text": "In her deposition, Maxwell appeared to confirm that Andrew visited Epstein's island in the U.S. Virgin Islands.",
    "redacted": ["Maxwell", "Andrew", "island"],
    "source": "Giuffre v. Maxwell Deposition Transcripts — reported by The Guardian",
    "context": "Andrew has denied visiting the island, contradicting multiple witness accounts.",
    "difficulty": "easy"
  },
  {
    "id": 30,
    "date": "2026-03-21",
    "text": "After Epstein's 2019 arrest, FBI agents discussed serving grand jury summonses to Maxwell and nine other alleged co-conspirators.",
    "redacted": ["grand", "nine", "co-conspirators"],
    "source": "FBI Email Records, DOJ Release — reported by Daily Mail",
    "context": "Three were located and served in Florida, with others found in Boston, NYC, and Connecticut.",
    "difficulty": "medium"
  },
  {
    "id": 31,
    "date": "2026-03-22",
    "text": "Donald Trump and Melania Trump were referenced more than 38,000 times across the released Epstein files collection.",
    "redacted": ["Melania", "38,000", "collection"],
    "source": "DOJ Epstein Files Analysis, February 2026",
    "context": "The frequency of mentions reflects the volume of documents, not allegations of wrongdoing.",
    "difficulty": "medium"
  },
  {
    "id": 32,
    "date": "2026-03-23",
    "text": "Epstein's estate is managed by lawyer Darren Indyke and accountant Richard Kahn, who controlled over 300 gigabytes of data.",
    "redacted": ["estate", "Indyke", "gigabytes"],
    "source": "DOJ Epstein Files, Estate Records — reported by ABC News",
    "context": "The estate data was stored in the FBI's Sentinel case management system.",
    "difficulty": "hard"
  },
  {
    "id": 33,
    "date": "2026-03-24",
    "text": "Alexander Acosta served as U.S. Attorney in Florida and approved the controversial non-prosecution agreement with Epstein in 2008.",
    "redacted": ["Acosta", "non-prosecution", "2008"],
    "source": "DOJ Records, Office of Professional Responsibility — reported by Miami Herald",
    "context": "Acosta later served as Secretary of Labor under Trump but resigned in 2019 amid renewed scrutiny.",
    "difficulty": "medium"
  },
  {
    "id": 34,
    "date": "2026-03-25",
    "text": "Peter Listerman was described in Epstein's files as a model scout and matchmaker who served as both a subject and witness.",
    "redacted": ["Listerman", "matchmaker", "witness"],
    "source": "DOJ Released Files, FBI Diagram — reported by CNN",
    "context": "Listerman appeared in the FBI's diagram of Epstein's inner circle of associates.",
    "difficulty": "hard"
  },
  {
    "id": 35,
    "date": "2026-03-26",
    "text": "The DOJ acknowledged that approximately 6 million pages might qualify as responsive documents under the Epstein Files Transparency Act.",
    "redacted": ["6", "million", "Transparency"],
    "source": "DOJ Statement, January 2026 — reported by CNN, NBC",
    "context": "Critics argued the 3.5 million pages released were insufficient given the total estimated volume.",
    "difficulty": "medium"
  },
  {
    "id": 36,
    "date": "2026-03-27",
    "text": "An Epstein employee told the FBI about delivering flowers to a student at Royal Palm Beach High School on Epstein's orders.",
    "redacted": ["flowers", "Royal", "School"],
    "source": "FBI Interview Notes, DOJ Release — reported by AP",
    "context": "The delivery was to commemorate the student's performance in a school play.",
    "difficulty": "medium"
  },
  {
    "id": 37,
    "date": "2026-03-28",
    "text": "Epstein was first indicted in New York in July 2019 on charges of sex trafficking and conspiracy involving dozens of minors.",
    "redacted": ["July", "trafficking", "conspiracy"],
    "source": "U.S. v. Epstein, SDNY Indictment — widely reported",
    "context": "The new charges came after journalist Julie Brown's reporting reignited public interest in the case.",
    "difficulty": "easy"
  },
  {
    "id": 38,
    "date": "2026-03-29",
    "text": "Gordon Brown's secret pseudonym was revealed as John Pond in emails found within the released Epstein document collection.",
    "redacted": ["Pond", "emails", "collection"],
    "source": "DOJ Epstein Files, Email Records — reported by BBC, ITV News",
    "context": "The pseudonym and Brown's secure email were allegedly shared with Epstein by Peter Mandelson.",
    "difficulty": "hard"
  },
  {
    "id": 39,
    "date": "2026-03-30",
    "text": "Victims and advocates criticized the Justice Department for heavy but inconsistent redactions of names throughout the released documents.",
    "redacted": ["advocates", "inconsistent", "redactions"],
    "source": "DOJ Release Response — reported by CNN, NYT",
    "context": "Five individuals on the FBI diagram had their names and photographs redacted by the DOJ.",
    "difficulty": "medium"
  },
  {
    "id": 40,
    "date": "2026-03-31",
    "text": "The Epstein investigation included files from five primary sources covering the Florida and New York criminal cases.",
    "redacted": ["five", "Florida", "York"],
    "source": "DOJ Press Release, January 30, 2026",
    "context": "Sources included cases against Epstein, Maxwell, investigations into Epstein's death, and the OIG investigation.",
    "difficulty": "easy"
  }
]
