[
  {
    "id": 1,
    "date": "2026-02-20",
    "headline": "Supreme Court Rules 6-3 That Universities Cannot Ban Political Speech on Campus",
    "redacted": ["Supreme", "Ban", "Speech"],
    "source": "Washington Examiner",
    "context": "The landmark ruling reaffirmed First Amendment protections for students expressing political views at public universities.",
    "difficulty": "medium"
  },
  {
    "id": 2,
    "date": "2026-02-21",
    "headline": "Texas Governor Signs Bill Requiring Border Wall Construction to Resume Immediately",
    "redacted": ["Texas", "Border", "Resume"],
    "source": "Daily Caller",
    "context": "Governor Abbott signed the executive order after months of legal battles over federal immigration enforcement.",
    "difficulty": "easy"
  },
  {
    "id": 3,
    "date": "2026-02-22",
    "headline": "Poll Shows Conservative Support Among Gen Z Voters Jumps 40 Percent Since 2024",
    "redacted": ["Conservative", "Jumps", "2024"],
    "source": "Fox News",
    "context": "The shift represents the largest generational political realignment in modern polling history.",
    "difficulty": "medium"
  },
  {
    "id": 4,
    "date": "2026-02-23",
    "headline": "Stanford Professor Fired After Refusing to Include Trigger Warnings in Constitution Course",
    "redacted": ["Stanford", "Fired", "Constitution"],
    "source": "New York Post",
    "context": "The tenured professor argued that the Constitution itself should not require content warnings.",
    "difficulty": "medium"
  },
  {
    "id": 5,
    "date": "2026-02-24",
    "headline": "Florida Becomes First State to Pass Parents Bill of Rights for K-12 Education",
    "redacted": ["Florida", "Parents", "Education"],
    "source": "Daily Wire",
    "context": "The legislation gives parents unprecedented authority over curriculum and library materials in public schools.",
    "difficulty": "easy"
  },
  {
    "id": 6,
    "date": "2026-02-25",
    "headline": "Elon Musk Releases Internal Documents Showing Government Censorship Requests to Twitter",
    "redacted": ["Musk", "Censorship", "Twitter"],
    "source": "The Federalist",
    "context": "The documents revealed thousands of takedown requests from federal agencies targeting political speech.",
    "difficulty": "easy"
  },
  {
    "id": 7,
    "date": "2026-02-26",
    "headline": "Federal Judge Blocks University From Punishing Students Who Invited Conservative Speaker",
    "redacted": ["Blocks", "Punishing", "Conservative"],
    "source": "Washington Free Beacon",
    "context": "The ruling stated that universities cannot retaliate against student groups for hosting controversial speakers.",
    "difficulty": "medium"
  },
  {
    "id": 8,
    "date": "2026-02-27",
    "headline": "Pentagon Confirms Military Recruiting Crisis as Applications Drop to Historic Low",
    "redacted": ["Pentagon", "Recruiting", "Historic"],
    "source": "Fox News",
    "context": "Defense officials blamed declining interest in military service among young Americans aged 18-24.",
    "difficulty": "medium"
  },
  {
    "id": 9,
    "date": "2026-02-28",
    "headline": "Campus Police Arrest Protesters Who Barricaded Conservative Event at Berkeley",
    "redacted": ["Arrest", "Barricaded", "Berkeley"],
    "source": "Daily Caller",
    "context": "The protest turned violent when demonstrators blocked entrances and pulled fire alarms during the event.",
    "difficulty": "hard"
  },
  {
    "id": 10,
    "date": "2026-03-01",
    "headline": "Trump Signs Executive Order Protecting Religious Liberty on College Campuses Nationwide",
    "redacted": ["Trump", "Religious", "Campuses"],
    "source": "Breitbart",
    "context": "The order threatens to pull federal funding from universities that discriminate against religious student organizations.",
    "difficulty": "easy"
  },
  {
    "id": 11,
    "date": "2026-03-02",
    "headline": "Harvard Endowment Loses Billions After Major Donors Pull Funding Over Antisemitism Scandal",
    "redacted": ["Harvard", "Billions", "Antisemitism"],
    "source": "New York Post",
    "context": "Several hedge fund managers and tech executives withdrew donations following the university's response to campus protests.",
    "difficulty": "medium"
  },
  {
    "id": 12,
    "date": "2026-03-03",
    "headline": "University of Florida College Republicans Named Organization of the Year by State GOP",
    "redacted": ["Florida", "Republicans", "Year"],
    "source": "The Alligator",
    "context": "UFCR was recognized for record membership growth and hosting nationally recognized speakers and events.",
    "difficulty": "easy"
  },
  {
    "id": 13,
    "date": "2026-03-04",
    "headline": "Virginia Governor Bans Gender Ideology Curriculum From All Public Elementary Schools",
    "redacted": ["Virginia", "Bans", "Elementary"],
    "source": "Daily Wire",
    "context": "Governor Youngkin's executive order requires parental consent for any instruction related to gender identity.",
    "difficulty": "medium"
  },
  {
    "id": 14,
    "date": "2026-03-05",
    "headline": "Supreme Court Upholds Landmark Ruling Expanding Second Amendment Rights for Young Adults",
    "redacted": ["Supreme", "Expanding", "Amendment"],
    "source": "Fox News",
    "context": "The 5-4 decision struck down laws preventing adults aged 18-20 from carrying firearms.",
    "difficulty": "hard"
  },
  {
    "id": 15,
    "date": "2026-03-06",
    "headline": "Columbia Suspends Conservative Student Club After They Hosted Detained Immigrant Families Event",
    "redacted": ["Columbia", "Suspends", "Immigrant"],
    "source": "Washington Examiner",
    "context": "The student group was placed on probation for allegedly violating campus event policies.",
    "difficulty": "hard"
  },
  {
    "id": 16,
    "date": "2026-03-07",
    "headline": "DeSantis Signs Law Banning Central Bank Digital Currency in Florida Commerce",
    "redacted": ["DeSantis", "Banning", "Currency"],
    "source": "Breitbart",
    "context": "Florida became the first state to explicitly prohibit CBDCs as a form of payment in state transactions.",
    "difficulty": "medium"
  },
  {
    "id": 17,
    "date": "2026-03-08",
    "headline": "Parents Pack School Board Meeting to Demand Removal of Critical Race Theory Materials",
    "redacted": ["Parents", "Demand", "Critical"],
    "source": "Daily Caller",
    "context": "Over 200 parents showed up to the meeting, forcing an emergency session on curriculum review.",
    "difficulty": "medium"
  },
  {
    "id": 18,
    "date": "2026-03-09",
    "headline": "Audit Reveals Five Million Ballots Lacked Proper Verification in Contested Election Counties",
    "redacted": ["Audit", "Million", "Verification"],
    "source": "The Federalist",
    "context": "The report found significant irregularities in signature matching and voter ID procedures.",
    "difficulty": "hard"
  },
  {
    "id": 19,
    "date": "2026-03-10",
    "headline": "Federal Appeals Court Strikes Down Nationwide Vaccine Mandate for Healthcare Workers",
    "redacted": ["Strikes", "Vaccine", "Healthcare"],
    "source": "Fox News",
    "context": "The ruling found that the mandate exceeded the administration's regulatory authority.",
    "difficulty": "medium"
  },
  {
    "id": 20,
    "date": "2026-03-11",
    "headline": "Columbia Protesters Occupy Hamilton Hall as Police Deploy Tactical Units to Campus",
    "redacted": ["Protesters", "Occupy", "Tactical"],
    "source": "New York Post",
    "context": "The occupation led to over 100 arrests and the cancellation of classes for the remainder of the semester.",
    "difficulty": "hard"
  },
  {
    "id": 21,
    "date": "2026-03-12",
    "headline": "Babylon Bee Wins Lawsuit Against Social Media Platform That Banned Satirical Article",
    "redacted": ["Babylon", "Wins", "Satirical"],
    "source": "Daily Wire",
    "context": "The court ruled that the platform's content moderation policies were applied inconsistently against conservative satire.",
    "difficulty": "medium"
  },
  {
    "id": 22,
    "date": "2026-03-13",
    "headline": "Parents Sweep School Board Elections Across Seven States in Historic Conservative Turnout",
    "redacted": ["Sweep", "Seven", "Conservative"],
    "source": "Breitbart",
    "context": "Parent-backed candidates won over 60% of contested seats, marking a significant shift in local education politics.",
    "difficulty": "medium"
  },
  {
    "id": 23,
    "date": "2026-03-14",
    "headline": "Trump Rally Draws Record Crowd as Campaign Raises Fifty Million in Single Weekend",
    "redacted": ["Trump", "Record", "Million"],
    "source": "Fox News",
    "context": "The fundraising haul broke previous records and demonstrated continued grassroots enthusiasm.",
    "difficulty": "easy"
  },
  {
    "id": 24,
    "date": "2026-03-15",
    "headline": "Google Whistleblower Testifies Before Congress About Political Bias in Search Algorithm",
    "redacted": ["Google", "Whistleblower", "Algorithm"],
    "source": "The Federalist",
    "context": "The former engineer presented internal documents showing systematic suppression of conservative news sources.",
    "difficulty": "hard"
  },
  {
    "id": 25,
    "date": "2026-03-16",
    "headline": "Louisiana Passes Law Requiring Ten Commandments Display in Every Public Classroom",
    "redacted": ["Louisiana", "Commandments", "Classroom"],
    "source": "Daily Caller",
    "context": "The controversial law was immediately challenged by civil liberties groups but upheld by the state supreme court.",
    "difficulty": "medium"
  },
  {
    "id": 26,
    "date": "2026-03-17",
    "headline": "Senator Introduces Legislation to Strip Federal Funding From Universities That Censor Students",
    "redacted": ["Senator", "Funding", "Censor"],
    "source": "Washington Free Beacon",
    "context": "The bill would require universities to certify compliance with First Amendment protections to receive federal grants.",
    "difficulty": "medium"
  },
  {
    "id": 27,
    "date": "2026-03-18",
    "headline": "Border Patrol Reports Record Apprehensions as Agents Detain Thousands at Southern Crossing",
    "redacted": ["Border", "Record", "Thousands"],
    "source": "Fox News",
    "context": "The surge in crossings overwhelmed processing facilities in Texas and Arizona.",
    "difficulty": "easy"
  },
  {
    "id": 28,
    "date": "2026-03-19",
    "headline": "Students Build Free Speech Wall After University Removes Conservative Flyers From Campus",
    "redacted": ["Speech", "Removes", "Flyers"],
    "source": "Daily Wire",
    "context": "The demonstration attracted national media attention and forced the university to revise its posting policies.",
    "difficulty": "medium"
  },
  {
    "id": 29,
    "date": "2026-03-20",
    "headline": "SpaceX Wins Three Billion Dollar Pentagon Contract Beating Legacy Defense Contractors",
    "redacted": ["SpaceX", "Billion", "Pentagon"],
    "source": "Breitbart",
    "context": "The contract marked a major shift toward private sector innovation in national defense infrastructure.",
    "difficulty": "medium"
  },
  {
    "id": 30,
    "date": "2026-03-21",
    "headline": "FBI Director Admits Bureau Monitored Social Media Posts of American Citizens Without Warrants",
    "redacted": ["FBI", "Monitored", "Warrants"],
    "source": "The Federalist",
    "context": "The admission came during heated congressional testimony about Fourth Amendment violations.",
    "difficulty": "hard"
  },
  {
    "id": 31,
    "date": "2026-03-22",
    "headline": "Heritage Foundation Report Finds Majority of Elite Universities Maintain Speech Codes",
    "redacted": ["Heritage", "Majority", "Speech"],
    "source": "Washington Examiner",
    "context": "The study analyzed policies at 200 universities and found widespread restrictions on protected expression.",
    "difficulty": "hard"
  },
  {
    "id": 32,
    "date": "2026-03-23",
    "headline": "Republican Candidate Wins Deep Blue District by Eleven Points Shocking Political Analysts",
    "redacted": ["Republican", "Eleven", "Shocking"],
    "source": "New York Post",
    "context": "The upset victory was attributed to parental rights and crime reduction messaging that resonated with suburban voters.",
    "difficulty": "medium"
  },
  {
    "id": 33,
    "date": "2026-03-24",
    "headline": "Disney Loses Billions in Market Value as Boycott Over Political Activism Intensifies",
    "redacted": ["Disney", "Billions", "Boycott"],
    "source": "Daily Wire",
    "context": "Shareholders expressed frustration as the company's stock continued declining amid consumer backlash.",
    "difficulty": "easy"
  },
  {
    "id": 34,
    "date": "2026-03-25",
    "headline": "Turning Point USA Conference Draws Largest Attendance in Organization History This Year",
    "redacted": ["Turning", "Largest", "History"],
    "source": "Breitbart",
    "context": "Over 10,000 young conservatives gathered for the annual event featuring prominent speakers and activists.",
    "difficulty": "medium"
  },
  {
    "id": 35,
    "date": "2026-03-26",
    "headline": "Teachers Union Opposes New Law Banning Cell Phones From Elementary School Classrooms",
    "redacted": ["Union", "Phones", "Elementary"],
    "source": "Fox News",
    "context": "Parents overwhelmingly supported the measure while union leaders called it an overreach of government authority.",
    "difficulty": "medium"
  }
]
